length = 5
breadth = 2

area = length * breadth

print('Area is', area)

print('Perimeter is', 2*(length + breadth)


# 1. 按位与是针对二进制数的操作，指将两个二进制数的每一位都进行比较，如果两个相 应的二进位都为 1 则此位为 1，否则为 0。在本例中， 5 的二进制表达为 101 ， 3 的 二进制表达为 11 (为补全位数进行按位操作写作 011 )，则按位与操作后的结果为
# 001 ，对应的十进制数为 1 。 ↩
# 2. 按位或是针对二进制数的操作，指将两个二进制数的每一位都进行比较，如果两个相 应的二进位有一个为 1 则此位为 1，否则为 0。在本例中， 101 与 011 进行按位或操 作后的结果为 111 ，对应十进制数为 7 。 ↩
# 3. 按位异或是针对二进制数的操作，指将两个二进制数的每一位都进行比较，如果两个 相应的二进位不同则此位为 1，相同为 0。在本例中， 101 与 011 进行按位异或操作 的结果为 110 ，对应十进制数为 6 。 ↩
# 4. 按位取反也称作“按位取非”或“求非”或“取反”，沈洁元译本译作“按位翻转”，是针对二进 制数的操作，指将两个二进制数的每一二进位都进行取反操作， 0 换成 1 ， 1 换成
# 0 。受篇幅与学识所限，本例具体原理不在此处赘述。读者只需按照给出的公式记忆即 可。 ↩